#Область ПрограммныйИнтерфейс

#Если Клиент Тогда
&НаКлиенте
// Пересчитывает сумму строки.
// Не загружает данные повторно.
Процедура ОбщийОбработчик(Элемент, Отказ = Ложь) Экспорт
	#Если ВебКлиент Тогда
	Сообщить("web");
	#Иначе
	Сообщить("other client");
	#КонецЕсли
КонецПроцедуры
#Иначе
&НаСервере
Функция СерверныйИтог(Знач Параметр = Неопределено) Экспорт
	Возврат Параметр;
КонецФункции
#КонецЕсли

#Область Внутренние
Процедура Внутренняя()
КонецПроцедуры
#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
Процедура Служебная() Экспорт
КонецПроцедуры
#КонецОбласти

#Область ПереопределяемыеПроцедурыИФункции
Процедура Переопределяемая()
КонецПроцедуры
#КонецОбласти

Процедура НеклассифицированныйЭкспорт() Экспорт
КонецПроцедуры

#Область Повтор
Процедура ПервыйПовтор()
КонецПроцедуры
#КонецОбласти
#Область Повтор
Процедура ВторойПовтор()
КонецПроцедуры
#КонецОбласти
