#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//АдресHTML = РеактивныйСервер.ЗагрузитьПриложение(
	//	РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетСобранныйHTML"),
	//	УникальныйИдентификатор
	//);
	
	// Отладка
	АдресHTML = "http://localhost:5173/";
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	РеактивныйКлиент.ОбработатьСообщение(ЭтотОбъект, Элементы.ПолеHTML, ДанныеСобытия, СтандартнаяОбработка,
		Новый ОписаниеОповещения("ОбработатьСообщение", ЭтотОбъект)
	);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьСообщение(Сообщение, Контекст) Экспорт
	
	Если Сообщение.ИмяСобытия = "Text" Тогда
		РеактивныйКлиент.ОтправитьОтвет(Элементы.ПолеHTML, Сообщение, НСтр("ru = 'Текст из 1С'"));
	КонецЕсли;
	
	Если Сообщение.ИмяСобытия = "Json" Тогда
		Результат = Новый Структура;
		Результат.Вставить("Text", НСтр("ru = 'Текст в json из 1С'"));
		РеактивныйКлиент.ОтправитьОтвет(Элементы.ПолеHTML, Сообщение, Результат);
	КонецЕсли;
	
	Если Сообщение.ИмяСобытия = "Blob" Тогда
		Результат = ПолучитьДвоичныеДанныеИзСтроки(НСтр("ru = 'Текст в blob из 1С'"));
		РеактивныйКлиент.ОтправитьОтвет(Элементы.ПолеHTML, Сообщение, Результат);
	КонецЕсли;

	Если Сообщение.ИмяСобытия = "SetFormAttribute" Тогда
		Если Сообщение.Значение["key"] = "Номер" Тогда
			Попытка
				ЗначениеВРеквизитФормы(Сообщение.Значение["value"], "Номер");
			Исключение
				Номер = Сообщение.Значение["value"];
			КонецПопытки;
			
			Сообщить(СтрШаблон(НСтр("ru = 'Demo-форма: Номер обновлен в %1'"), Номер));
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
