&НаКлиенте
Перем ModuleValue;

&НаСервере
Процедура СоздатьПараметры()
    Добавляемые = Новый Массив;
    Добавляемые.Добавить(Новый РеквизитФормы("RuntimeCode", Новый ОписаниеТипов("Строка")));
    Добавляемые.Добавить(Новый РеквизитФормы("RuntimeFlag", Новый ОписаниеТипов("Булево")));
    ИзменитьРеквизиты(Добавляемые);
КонецПроцедуры

&НаСервере
Процедура УстановитьНачальныеЗначения()
    RuntimeFlag = Истина;
КонецПроцедуры

&НаСервере
Функция ОшибочныеЧтения()
    Возврат Новый Структура("Код,Флаг", RuntimeCode, RuntimeFlag);
КонецФункции

&НаСервере
Функция КорректныеЧтения(Параметр)
    Локальная = Параметр;
    Возврат Новый Структура("Код,Флаг,Статика,Локальная", ЭтотОбъект.RuntimeCode,
        ЭтотОбъект.RuntimeFlag, StaticCode, Локальная);
КонецФункции

&НаКлиенте
Функция КонтрольКлиента(Параметр)
    ModuleValue = Параметр;
    Возврат Новый Структура("Модульная,Статика", ModuleValue, StaticCode);
КонецФункции

&НаСервереБезКонтекста
Функция КонтрольБезКонтекста(Параметр)
    Возврат Параметр;
КонецФункции
