#Область ПрограммныйИнтерфейс

#Область ДанныеВБазе

// Возвращает значение реквизита объекта.
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует использовать ЗначениеРеквизитаОбъекта.
Функция ПолучитьЗначениеРеквизита(Ссылка, ИмяРеквизита) Экспорт
	Возврат ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриНачалеРаботыСистемы() Экспорт
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

Функция ЭтоСлужебныйОбъект(Ссылка) Экспорт
	Возврат Ложь;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстОшибки(Ошибка) Экспорт
	Возврат Строка(Ошибка);
КонецФункции

#КонецОбласти

Процедура ВнеОбластей() Экспорт
КонецПроцедуры
