#Область ПрограммныйИнтерфейс

// Загружает реактивное приложение как в веб клиенте так и в тонком
//
// Параметры:
//  ДвоичныеДанные - ДвоичныеДанные - Реактивное приложение, например полученное из макета
//  УникальныйИдентификатор - УникальныйИдентификатор - Для управления временем жизни временного хранилища
//
Функция ЗагрузитьПриложение(ДвоичныеДанные, УникальныйИдентификатор) Экспорт
	
	Если КлиентскоеПриложение.ТипПриложения() = ТипКлиентскогоПриложения.ВебКлиент Тогда
		Возврат ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные);
	Иначе
		Возврат ПолучитьНавигационнуюСсылкуИнформационнойБазы() + "/"
			+ ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	КонецЕсли;
	
КонецФункции

#КонецОбласти
